OpenFOAM-7-master/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    vessel
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    oilInlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    shaftRotating
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    shaft
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    sparger
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    stirrer
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    baffles
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
